Revit 2027 API
ParameterTypeId.RailingSystemHandrailsLatteralOffset Property
 "Lateral Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingSystemHandrailsLatteralOffset { get; }
Public Shared ReadOnly Property RailingSystemHandrailsLatteralOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingSystemHandrailsLatteralOffset {
	ForgeTypeId^ get ();
}
static member RailingSystemHandrailsLatteralOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace